""" funzionamento

problema: ho un file json con dati abbastanza complessi che presentano dei doppioni, cioè ci sono gli stessi oggetti json due o più volte. 
La logicadi questo programma è semplice: 
data la lista degli elementi che si ripetono più di una volta, la prima funzione li estrae, ottendo una lista di tutti gli oggetti json doppioni. Ovviamente in questa lista
ogni oggetto json è ridotto a uno solo. 

La seconda funzione invece prende tutti gli elementi che sono doppioni e li elimina spudoratamente -> c'è un problema:  se ha una lista di parole da eliminare perché doppione, le elimina tutte, 
quando invece dovrebbe lasciarne uno. 

Ecco che, alla fine dello script, faccio semplicemente la somma delle parole che erano doppioni (ovviamenete i doppioni sono stati eliminati) + tutta la lista originale senza nessun doppione (quella senza nemmeno l'accoretezza di lasciarne uno

"""

import json 

doubles_to_delete = [
                "διαπρεπής", "ἐπιβιόω", "διαπρεσβεία", "πάραλος", "διαπόντιος", "ἐπερώτησις", "παρακοπή", 
                "ἐπέλπομαι", "παρακοίτης", "διαπειλέω", "παρακαταβάλλω", "παραίτησις", "ἐπανίημι", "διαμηρίζω", 
                "ἐπικλίνω", "καταπροΐεμαι", "παρασημαίνομαι", "ἐπίηρα", "πανουργία", "ἐπικλάζω", "διατριβικός", 
                "ἐπιγουνίς", "Ἑρμιόνη", "παρεξειρεσία", "ἐπιμανθάνω", "παρασπόνδησις", "διαφοιτάω", "διαυγής", 
                "καταφλέγω", "παραφθάνω", "διεξοδικός", "κατασπείρω", "διεκβάλλω", "κατασκώπτω", "διεγείρω", 
                "παχνόω", "δοιάζω", "παράφραγμα", "παρισόω", "περίκλασις", "ἐπίπλοος", "κινδύνευμα", "διφρηλάτης", 
                "ἐπιτροπεία", "διπλασιάζω", "πλυνός", "ἐπίχαρις", "παρηορία", "Ἐρατώ", "ἐργαστήριον", "ἑπταετής", 
                "παρόρμησις", "ἐρίκτυπος", "δουράτεος", "δορίκτητος", "πατροκτόνος", "πάρμη", "ἐριβρεμέτης", 
                "ἐρίβρομος", "δύσκριτος", "κυΐσκομαι", "πέδοι", "προσλεύσσω", "προσεταιρίζομαι", "κτητός", 
                "δρύοχοι", "προσεντέλλομαι", "πατροφονεύς", "προφράζω", "κωλύμη", "προτελέω", "περίοιδα", 
                "κυπάρισσος", "δυσηλεγής", "πεζακοντιστής", "πύρνον", "δύσφημος", "εὔθυνα", "πειθαρχία", 
                "δυσκέλαδος", "εὐγνώμων", "εὐθυπορέω", "εὖθριξ", "δυσώδης", "πειραίνω", "εὔμορφος", "ἐγγυητής", 
                "μαντόσυνος", "εὐροέω", "εὐπρόσοδος", "ἐγχείρημα", "εὐράξ", "ἐγκριτέος", "κᾶλον", "σύμφυτον", 
                "ἐφιζάνω", "εἰκασία", "ἐθελοκάκησις", "συνερείδω", "μεταδοκέω", "πελτοφόρος", "εἰσαγωγή", 
                "εἰσκατατίθημι", "ἔφαλος", "ἐξοικίζω", "κνώδων", "κναφεῖον", "προναυμαχέω", "προμνηστῖνοι", 
                "κοινωνικός", "προλυπέομαι", "κοινωνητέος", "κοινώνημα", "κοινότης", "κοιταῖος", "κύμβαχος", 
                "καλλίπολις", "κομπώδης", "κολυμβητής", "κόλλοψ", "κορυζάω", "κραδίας", "κόναβος", "κόνιος", 
                "σκηνοποιία", "κατάχυσμα", "κοππατίας", "κόφινος", "κρᾶσις", "κουρίξ", "κρήνηνδε", "κυδοιμέω", 
                "κητώεις", "κρίζω", "Κρῖσα", "συγκατακαίω", "συγκαταδουλόω", "συγκαλύπτω", "κρεμάθρα", "κροκωτός", 
                "κροαίνω", "κροταλίζω", "κυβέρνησις", "κνυζόω", "κρύβδα", "συναισθάνομαι", "Ἀμαθοῦς", "κύλινδρος", 
                "κονιορτόω", "κρίκος", "κτίδεος", "συνεπιμελέομαι", "κόλος", "μετάγγελος", "συντρέφω", "κυδάζω", 
                "συντειχίζω", "μεταστροφή", "Κυνόσαργες", "Ταρτήσσιος", "λαοφόρος", "ταναύπους", "κυματίας", 
                "μετώπιον", "κύμινδις", "κύρτωμα", "κυναγός", "κύτος", "τριόρχης", "κυπτάζω", "φύτλη", "μυθολόγος", 
                "κυψέλη", "κυρτόω", "κωδωνίζω", "τωθάζω", "κωδωνοφορέω", "Λαΐειος", "κύρτη", "ὑποικουρέω", "κωπέω", 
                "λαβρεύομαι", "λασιαύχην", "λωβητός", "μᾶ", "λάχεια", "φιλοκερδέω", "λυσσάς", "ὅδιος", "φιαληφόρος", 
                "λάξις", "λευκανθής", "λιθόστρωτος", "ξυνήϊος", "φέρετρον", "λακίς", "λαιμοτομέω", "μαλθάσσω", 
                "φορεῖον", "φονικός", "φοινικοβάλανος", "λαφυροπώλης", "λείψανον", "χορτολογία", "ὁμονοητικός", 
                "λειτουργέω", "λεπίς", "ὄπατρος", "ψευδολόγος", "λεπτόγειος", "λευκόπετρον", "μετεκβαίνω", 
                "Ἀθαμαντίς", "λευκόθριξ", "λευκαίνω", "Λεωκόρειον", "ληπτέος", "μήνιμα", "Ἀσκάνιος", "λήϊτον", 
                "παίδειος", "λιβανωτοφόρος", "λιθάς", "Ἀλιλάτ", "μόσχειος", "παλιμπλάζομαι", "λιθόβολος", "παλεύω", 
                "Ἴσμαρος", "παλαιόφρων", "λησμοσύνη", "Λαιστρυγόνιος", "πανταχοῖ", "λιποψυχέω", "λογιστής", 
                "λικριφίς", "Λίμναι", "Ἀργινοῦσαι", "λιχμάζω", "λίψ2", "Κήρινθος", "λινόδετος", "Πολυκτορίδης", 
                "Πολυδώρη", "Ποδαλείριος", "Ποίας", "Σείριος", "ξενολόγος", "Ὑπερησίη", "σκηπάνιον", "ξερόν", 
                "πελεκίζω", "οἰκητός", "θεωρικός", "λοιμώδης", "θαλαμιός", "λοισθήϊος", "Λυκηγενής", "λυμεών", 
                "ὀλβία", "οἰνών", "πεμπάς", "κελήτιον", "οἶμα", "οἰκόπεδον", "λωβεύω", "Φαίνιππος", "ὄρχις", 
                "ὀργάζω", "περιωδυνία", "Δοῦρις", "Ἄφιδνα", "λωτοφάγοι", "λώπη", "λωποδυτέω", "μάννα", "μανιάκης", 
                "ἐπιμύζω", "ὀχμάζω", "ἐμπαίζω", "παντέλεια", "πανηγυρικός", "Πάνιον", "ἕψημα", "παλίντιτος", 
                "μαργάω", "παραφορά", "παράνοια", "παραμυθία", "παρακλείω", "ἀνάδειξις", "χαλκοχάρμης", "πεντετάλαντος", 
                "μελάγγαιος", "μεγαληγορέω", "ἀνάβλησις", "περιωθέω", "ἀμφίθετος", "μειρακίσκος", "μελάγχιμος", 
                "μελῳδέω", "πολυαρχία", "πολλαπλόος", "πολεύω", "ἀβεβαιότης", "μελανείμων", "μελανία", "μεσοπύργιον", 
                "προπονέω", "μεσαιπόλιος", "πρίων", "πρακτήρ", "ποταμόνδε", "πόρκης", "μέτρησις", "μεταίρω", 
                "προπομπή", "μεταδοξάζω", "ἕψησις", "μετατάσσω", "μεταθέω", "ῥοδῆ", "ῥήτρα", "μεταυτίκα", "ῥᾴδια", 
                "πυρία", "πυράγρα", "μέταρσις", "μεταστοιχεί", "σιτεύω", "σίσυρνα", "σίμβλος", "πτέρωσις", 
                "σπαράσσω", "σκυτόω", "σκῶλος", "σπάρτος", "στυλόω", "μετοχλίζω", "μέτρημα", "συγκάμνω", "στίβη", 
                "στρατηγιάω", "μετοχή", "συλεύω", "συγκύρημα", "συλλαλέω", "συγκινέω", "συγκλίνω", "σίγλος", 
                "συνδεσμώτης", "συνειλέω", "συναφή", "συνδιαπράσσω", "συνεπιβάλλω", "ὑπερθύριον", "τυλόω", "τυμβήρης", 
                "τρωτός", "τρώκτης", "μύρτων", "συνείρω", "συνεκχέω", "μηλόβοτος", "μισοτύραννος", "μυκόομαι", 
                "ὑποτείχισμα", "μηρύομαι", "ὑπομονή", "σπάραγμα", "μῆνιγξ", "φίλαυλος", "φιλάρματος", "χαλκέων", 
                "χαλίφρων", "φύτευμα", "φυλέτης", "φρυκτωρία", "συμπαραλαμβάνω", "ψευδόμαντις", "ὠή", "χυτλόω", 
                "μιλτοπάρηος", "ψαρός", "μογερός", "Δημοφῶν", "Μενέσθιος", "Ἡγησίλεως", "Καΰστριος", "νήπτης", 
                "οἰνηρός", "μολπάζω", "Μελανθώ", "Δυναμένη", "Θών", "Ὀφέλτιος", "ἀλεξίμβροτος", "Ἴσανδρος", 
                "Ἱππόμαχος", "διάημι", "μοναχοῦ", "μοιράω", "μόλιβος", "Λάγος", "μορόεις", "Μόλος", "μυριάρχης", 
                "Κτιμένη", "Κυμοθόη", "Κρήθων", "μοχλεύω", "συρμαία", "Κλύμενος", "Μάρις", "μονόλιθος", "Χύτροι", 
                "Πύρασος", "Ῥοίτειον", "μοχλέω", "Ὦρος", "μυδαίνω", "παιάν", "Κρᾶθις", "ἑωσφόρος", "μουνάξ", 
                "μουσοποιέω", "νηλίπους", "χήνειος", "μυθολογεύω", "μυρρινάω", "Φολόη", "τετράκνημος", "ὁμόριος", 
                "κάππα", "Καύκων", "νεούτατος", "χεῖ", "τρῖμμα", "τριακάς", "Πείραιον", "Κόρκυρα", "Ἐγνατία", 
                "Ἀφιδναῖος", "Ἀμμώνιος2", "ὑποδράω", "ναυκληρέω", "ἄβρομος", "ἀβολέω", "ὑποτύφω", "ἀβελτερία", 
                "ἁβροδίαιτος", "ὑπάτη", "ναύφρακτος", "αἴλινος", "Ἀγήσανδρος", "ἀγερωχία", "ἄγευστος", "ἀγαυρός", 
                "ἀγρονόμος", "νήγρετος", "νεότευκτος", "νεότομος", "ἀγωγεύς", "ἀδιάβατος", "ἀδηλόω", "ἀδήϊος", 
                "ἄθραυστος", "ἀθεραπευσία", "ἄθεμις", "ἄημα", "ἀηθέω", "νόμισις", "αἶθος", "νομοθέτημα", "αἴητος", 
                "ἀϊδνός", "ξενηλατέω", "νυμφικός", "κάρυον", "αἰσχρουργία", "αἱρετέος", "νοσοτροφία", "αἶπος", 
                "ξενιτεύω", "ἀκοντίας", "ξενοδοκέω", "ξυστίς", "ἄκτινος", "ἄκτωρ", "ἄκυλος", "ξηρότης", "ἀλαστέω", 
                "ἀλκυονίς", "ὀγδοηκοστός", "οἰκοδόμησις", "ἀνακόπτω", "οἰκίδιον", "ἅμιππος", "ἀμήτωρ", "ἀμουσία", 
                "ἀναθετέος", "ὀδυνηρός", "ἀμφιλύκη", "ἀμφιθαλής", "ἀμφίδυμος", "ἀναδέρκομαι", "ἀναδαίω", "οἰόρπατα", 
                "ἀνάγωγος", "οἰσύϊνος", "οἰνώψ", "διαβοάω", "ὁμοδοξέω", "ὀχληρός", "συνθνῄσκω", "συνηρεφής", 
                "συνημοσύνη", "ἀντιπληρόω", "ὀλοφυδνός", "ἀνάπαιστος", "ἀνάντης", "ἀναντίρρητος", "Ἄναυρος", 
                "συνώνυμος", "ἀνάσκητος", "ἀναστενάχω", "Ὀλυμπικός", "Ὁμηρικός", "Ὀλυμπιόνικος", "ἀνδραποδιστής", 
                "ὁμαιχμία", "ὁμήγυρις", "ἀνήνυτος", "ἀνέζω", "ἀνεννόητος", "Ὁμηρίδης", "ὀρσοθύρη", "ἀνηγέομαι", 
                "ἄνη", "ἀνερέπτομαι", "ὁρατής", "ἀγανόφρων", "ἁλιπόρφυρος", "ἁλιμυρήεις", "ἀνταμείβομαι", "ἀγύρτης", 
                "ἀντεπιβουλεύω", "ἀντερείδω", "ἄντιτος", "ἀφόρητος", "ἀϊκή", "ὀπτήρ", "ἀνατατικός", "ὅπλομαι", 
                "ὁποτέρωσε", "ὀπίστατος", "ἀντίπαις", "ἀνυπότακτος", "ὀπωρίζω", "ἀπάλαλκε", "ἀπειρόω", "ὁρκίζω", 
                "ἄοινος", "ὁρμαθός", "ἀπαΐσσω", "ἀποκρεμάννυμι", "ἀποκαραδοκέω", "ἀπεννέπω", "ἀμφιπίπτω", "ἀμφιδέξιος", 
                "ἀποσεμνύνω", "ἀμυνάθω", "ἀποπρολείπω", "ἀποπρεσβεία", "ἀποπέρδομαι", "ἀριστίνδην", "ἀριστεία", 
                "ἀναθέω", "ἀρίδηλος", "ἀνακῶς", "ἀρέσκεια", "δαιτρός", "ἀργυρολόγος", "ἀράχνιον", "δεκαναΐα", 
                "ἀσέληνος", "ἀρχιτρίκλινος", "ἄναλτος", "ἀναισχυντέω", "ἀπόλεκτος", "ἀπόερσε", "ἀτροπία", "ἀπόδοτος", 
                "ἀνασείω", "πάγκακος", "βέλεμνον", "ἀνταῖος", "ἀποκαλύπτω", "ἀποσημαίνω", "γελωτοποιός", "ἀπομιμνῄσκομαι", 
                "γαστρίμαργος", "ἄπολος", "ὀρφανίζω", "ἀποπηδάω", "ἀποπληρόω", "ἀποσκίδνημι", "διακομιδή", "ἀπήμαντος", 
                "ἀποπορεύομαι", "ἀπραγέω", "διαφθορεύς", "ἀποκριτέος", "ἀποφθινύθω", "ἀτάλλω", "ἀπουσία", "διαστασιάζω", 
                "ἀποσυνάγωγος", "ἀποσυλάω", "διοίχομαι", "διοικίζω", "διμοιρία", "ἀπωστός", "ἀπριάτην", "ἀποψηφίζομαι", 
                "ἀπτήν", "ἀρβύλη", "ἀρατός", "ἀρνευτήρ", "ἀρκτικός", "ἐγκάθημαι", "εἰλυφάζω", "Ἄρεος", "ἄστυδε", 
                "οὐδαμόθεν", "ἀσάλευτος", "ὀτλέω", "ἀρχεύω", "ἄρριχος", "ἀρρωστέω", "ἄρρωστος", "ἀτραπιτός", 
                "ἐκφροντίζω", "ἐκτελευτάω", "ἀσάφεια", "ἀταρτηρός", "ἀχερωΐς", "βουκολία", "παιδοφόνος", "ἐλεγεῖον", 
                "ἐναγίζω", "ἀσκητός", "ἐμπολιτεύω", "ἀσταφίς", "ἀστάθμητος", "προερέσσω", "ἀτίετος", "ἀτελεύτητος", 
                "ἀσφόδελος", "ἀσύμμετρος", "ἐπιδιαιρέω", "βόλος", "ἐπίρρυτος", "ἐπίπροσθεν", "Γάλλος", "ἀτυχής", 
                "βύρσα", "βρωτός", "ἔξαρνος", "ἐπικώμιος", "ἐπικοσμέω", "βρόχω", "ἐπαναστρέφω", "ὄχανον", "ὀχάομαι", 
                "Ἅφαιστος", "ἀφάλλομαι", "αὐτόπρεμνος", "δεῖνα", "διαχειρίζω", "παθητικός", "ἁφή", "εὐρύπορος", 
                "εὔρυθμος", "ὄχνη", "ἀχλύω", "παιδοκτόνος", "ἀχρηστία", "διάκρισις", "ζωοποιέω", "διαμφισβητέω", 
                "διακινέω", "ἀφραίνω", "ἰδρεία", "βαναυσία", "βαρβαρισμός", "βαλανεύς", "παλίνορσος", "καθαρεύω", 
                "ἑτεροῖος", "καθαίρεσις", "βεβαίωσις", "βάτος", "βιαιομαχέω", "ἰσοϋψής", "βαρυαχής", "παλίγκοτος", 
                "βίβλος", "βιβάσθω", "παλαισμοσύνη", "παμπήδην", "καρχαλέος", "παμμέλας", "παμμιγής", "δυσθετέω", 
                "παλιρρόθιος", "βλαστός", "εὐτρεπίζω", "πανωλεθρία", "παραβλώσκω", "ζαμενέω", "κατακληρουχέω", 
                "βριθοσύνη", "βρομέω", "βριάω", "γειτνίασις", "παραδεκτέος", "παραδύομαι", "γαῖσος", "γαμετή", 
                "γενειάω", "γεωπείνης", "κατασκεδάννυμι", "θερισμός", "ἐκπομπή", "ἐκπετάννυμι", "θεομήστωρ", "καταρράπτω", 
                "ἐκνέω", "κατωμαδόν", "ἔκφρων", "ἔκφυσις", "κνάπτω", "ἱεροφάντης", "παραιθύσσω", "γνώμων", "Γόργειος", 
                "ἐλελίχθων", "ἐναντίωμα", "ἐμπήγνυμι", "ἔμμισθος", "γραμματικός", "ἐμπάσσω", "ἔνθαπερ", "ἐνεῖδον", 
                "λαοδογματικός", "δαπάνημα", "λακέρυζα", "ἐνάλλομαι", "ἐνστάζω", "δεξιότης", "δεκαπλάσιος", "ἐξασκέω", 
                "δημηγορέω", "μηνιθμός", "μηλοτρόφος", "ἔξαλλος", "δευτερεῖος", "ἐξακοντίζω", "ἐξαναδύομαι", "δερμάτινος", 
                "διαγνώμη", "διαβατήρια", "διακόσμησις", "ἐπεξάγω", "καταιθαλόω", "ἐπακτήρ", "διακαρτερέω", "διαθήκη", 
                "ψύλλα", "οἰωνιστής", "οἰνόπεδος", "οἰκονόμος", "ἐπανάγκης", "ὀνήσιμος", "διαμηχανάομαι", "διαλύτρωσις", 
                "ζάλη", "πέμμα", "εἰσότε", "ἐφίμερος", "ἑκατόμβοιος", "πενταετής", "ἡγηλάζω", "ζυγόω", "ζωάγρια", 
                "ἐμπυρισμός", "ἴσκε", "πεντηκοντούτης", "πεπαίνω", "ἦνοψ", "πεντάστομος", "ἐκνικάω", "θάκημα", 
                "ἐκμηρύομαι", "ἕκμηνος",     "ἐκμοχθέω", "ἐκκυβεύω", "ἑκυρά", "περίβλεπτος", "ἐκπεριπλέω", "ἐκνεύω", "ὑπομνηματισμός", 
                "ἐκπρομολεῖν", "ἐκπαγλέομαι", "ἐκτομή", "ἔκπυστος", "φευκτέος", "ξυλεία", "φαυλότης", "θειόω", 
                "ἐκτήκω", "θεμιστοπόλος", "ἐλαστρέω", "ἶδος", "ἐκχώννυμι", "Ἑλικώνιος", "περιπετής", "ἐλεφάντινος", 
                "περιέργω", "ἐμβαδόν", "περίζωμα", "ἐμπεδόω", "ἐμβοάω", "ἐμβάς", "περικήδομαι", "ἐμπρόσθιος", 
                "ἐπαναβαίνω", "ἔμφρουρος", "ἐμπορικός", "περίκλυστος", "περιτροπή", "περικόπτω", "ἐναταῖος", "λεύω", 
                "ἔνδειξις", "ἐνετή", "ἐνδοιάζω", "περιτρέφω", "ἐνορούω", "περισαίνω", "ἐνωπή", "Περσιστί", "ἐντυπάς", 
                "ἐνυβρίζω", "νεήκης", "πεσσός", "πηδός", "ὀλιγοδρανέω", "Ὄθρυς", "ἑξακισμύριοι", "οἴαξ", "ἐξακέομαι", 
                "ὁμογνωμονέω", "ἔξαλος", "ἐξαμάω", "ἐξαίρεσις", "πιμελή", "ὀφείλημα", "οὖ", "παρακαλύπτω", "ἐξοδάω", 
                "ἐξομιλέω", "Πιτανήτης", "ἐπαλλάσσω", "πίτυλος", "ἐπαλαστέω", "παρίσχω", "πάροικος", "ἐπαγείρω", 
                "περιγηθής", "Πλαταιικός", "φυσιολογία", "πινυτή", "πιλέω", "πικρόγαμος", "ἐπαμφοτερίζω", "χρυσάρματος", 
                "πηδόν", "περιφράσσω", "ἐπερώτημα", "πολύκλητος", "ἐπεῖπον", "ἐπητής", "ἐπίγονος", "πλεονασμός", 
                "ἐπιβούλευμα", "ἐπιβατός", "ἐπίβουλος", "ἐπιβρομέω", "τετραπλόος", "τετράορος", "πλεθριαῖος", "ἐπίδηλος", 
                "πλήμνη", "ἐπικέλομαι", "πυλαωρός", "πτώξ", "ἐπικατασφάζω", "πτίλον", "ἐπιζώννυμι", "στύραξ2", "συβόσιον", 
                "ἐπιορκία", "συναρχία", "τύμπανον", "πολεμιστήριος", "τανύφυλλος", "ταλαύρινος", "σωφρονιστής", 
                "σχεδιάζω", "ἐπιρραίνω", "ἐπιρράσσω", "πλουτίζω", "τρῆμα", "τραπεζίτης", "τοξόδαμνος", "ἐπισιτισμός", 
                "πολύφημος", "ὕπουλος", "ὑποβλήδην", "πολυθαρσής", "ὑποκάτω", "ἐπισφάζω", "ὑπεροψία", "ἐπιστημόω", 
                "πολύαινος", "φλιά", "φάσις", "Δαυλίς", "πολισσοῦχος", "φαλαγγηδόν", "Αἰτώλιος", "φυκτός", "πολυᾶϊξ", 
                "ἐπιχωρέω", "χαλκεία", "χαροπός", "πολύξενος", "πολυπενθής", "ἐργατίνης", "ἐρεύγομαι2", "χαμεύνη", 
                "πορφυρίς", "ὦλξ", "Ἀνδραίμων", "Κλεόβουλος", "ἑταιρέω", "Γάργαρον", "ἔσθημα", "Αἰγιαλός", "ἑταιρικός", 
                "ποτανός", "γένεθλον", "Ἐτεοκλέης", "πρᾶσις", "εὐτειχής", "ἶρις", "ἑτοιμότης", "Μεγαπένθης", "Γορδίας", 
                "Δελφίς", "Δεῖμος"]


# questa f recupera tutti gli elementi doppioni, mettendoli in una lista (ovviamente se un elemento è presente più volte lo elimina)
def retrieve_doubles():
    try:
        
        with open("dict_601_800.json", "r") as file:
            data = json.load(file)
            
            #faccio una copia della lista di doppioni, almeno opero su quella e non intacco quella originale
            copy_doubles_to_delete = doubles_to_delete.copy()
            
            
            elements_to_retrieve = []
            for element in data:
                if element["lemma"] in copy_doubles_to_delete:
                    elements_to_retrieve.append(element)
                    del copy_doubles_to_delete[copy_doubles_to_delete.index(element["lemma"])]
                    
            
                        
        print(f"elementi recuperati: {len(elements_to_retrieve)}")
            
       
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    
    return elements_to_retrieve



def delete_double():
    try:
        
        with open("dict_601_800.json", "r") as file:
            data = json.load(file)
            print(f"Lunghezza file iniziale: {len(data)}")
            
            for element in list(data):
                if element["lemma"] in doubles_to_delete:
                    del data[data.index(element)]
            
                    
            
                        
            print(f"elementi senza nessun doppione {len(data)}")
            
            
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    return data
    
   




combined_data = retrieve_doubles() + delete_double()

with open("dict_601_800_cl.json", "w") as file:
    json.dump(combined_data, file, ensure_ascii=False, indent=2)

