""" funzionamento

problema: ho un file json con dati abbastanza complessi che presentano dei doppioni, cioè ci sono gli stessi oggetti json due o più volte. 
La logicadi questo programma è semplice: 
data la lista degli elementi che si ripetono più di una volta, la prima funzione li estrae, ottendo una lista di tutti gli oggetti json doppioni. Ovviamente in questa lista
ogni oggetto json è ridotto a uno solo. 

La seconda funzione invece prende tutti gli elementi che sono doppioni e li elimina spudoratamente -> c'è un problema:  se ha una lista di parole da eliminare perché doppione, le elimina tutte, 
quando invece dovrebbe lasciarne uno. 

Ecco che, alla fine dello script, faccio semplicemente la somma delle parole che erano doppioni (ovviamenete i doppioni sono stati eliminati) + tutta la lista originale senza nessun doppione (quella senza nemmeno l'accoretezza di lasciarne uno

"""

import json 

doubles_to_delete =['ἀμύσσω', 'διαπλέκω', 'διακλίνω', 'διαζάω', 'διασκευή', 'καταστορέννυμι', 'διαπορθμεύω', 'Νιόβη', 'παραείδω', 'γειτνιάω', 'Πανιώνιον', 'δρηστήρ', 'Καρδία', 'δρύϊνος', 'δορά', 'Πετεώς', 'τριχῆ', 'ὑπερπέτομαι', 'ἐμπολάω', 'Ἰουδαία', 'Βάκις', 'κατόμνυμι', 'διοϊστεύω', 'ὕδρα', 'κατήφεια', 'δίπηχυς', 'καταχρυσόω', 'κόθορνος', 'κύβος', 'δύσφορος', 'ἑξάμετρος', 'Νῖσος', 'Κότυς', 'δολιχήρετμος', 'διοράω', 'Ἕρμιππος', 'κελευστής', 'ἐπαίτιος', 'εἰσβιβάζω', 'Ἄκαστος', 'τρύω', 'βῶλαξ', 'Μύρκινος', 'Ἐλευσίνιος', 'παρέζομαι', 'ἐπικύρω', 'αἰχμοφόρος', 'ἐπικαθίστημι', 'ἐπιγνάμπτω', 'κεραυνίας', 'πυροφόρος', 'αὐθάδεια', 'ἐπίφρων', 'ἐργάτης', 'ἐπιτολή', 'ὑπέρθεσις', 'Ἀβδηρίτης', 'κηδεστής', 'κίβδηλος', 'ἀγρέω', 'ἐπίκλοπος', 'ἀγοραῖος', 'ἀποπέτομαι', 'ἀγκάς', 'ἁγνίζω', 'παροίτερος', 'θεοσεβής', 'αἴνιγμα', 'ἀδιάπτωτος', 'Κηφισός', 'ἴδη', 'καινόω', 'κληρονόμος', 'εἰκαθεῖν', 'εἰσάπαξ', 'ἀϊδρείη', 'κομπάζω', 'ἔκδηλος', 'εἴσαντα', 'αἱμύλος', 'εἰσνοέω', 'ἄκαιρος', 'κλεῖθρον', 'ἐκδιδράσκω', 'ἀκρόασις', 'κληρόω', 'κλισίηθεν', 'εὔας', 'Ῥηνεία', 'πρεσβεῖον', 'πρέμνον', 'εὐάρματος', 'πρᾶσις', 'εὔανδρος', 'Λεοντιάδης', 'Ἄτυς', 'εὐεργός', 'Κάμειρος', 'εὐεπίθετος', 'ἀνάεδνος', 'γυμνοπαιδίαι', 'Φήμιος', 'εὐκίνητος', 'εὐνητήρ', 'Πλευρών', 'προαπόλλυμι', 'Κητώ', 'Πετραῖος', 'Καρδαμύλη', 'Σάκας', 'ὀρείτροφος', 'Τέλλος', 'Πολύκλειτος', 'εὐπηγής', 'Κόρη', 'προεξάγω', 'εὐπρέπεια', 'εὐλαβητέος', 'Τιθραύστης', 'Στησίμβροτος', 'Διόσκοροι', 'εὐνοϊκός', 'ἐϋπλυνής', 'Ἄκτιον', 'Χαιρέας', 'Πασίων', 'Χοάσπης', 'Παῦλος', 'προξενέω', 'Τορκουᾶτος', 'Μεθυδριεύς', 'ἔκθεσις', 'Κηφεύς', 'Ἐτεόνικος', 'ἑκατογκεφάλας', 'ἁγιάζω', 'εἰσαγείρω', 'εἰνάτερες', 'Ἐχῖναι', 'Ὠρεός', 'ἐκπυνθάνομαι', 'εὐτράπελος', 'ἐπιτειχισμός', 'Πυθίων', 'λευρός', 'ἔμβρυον', 'παχύνω', 'συνέλκω', 'ἀγγελιαφόρος', 'ἀβίωτος', 'ἐπίτιμος', 'ἀπαυδάω', 'ἐξορύσσω', 'ἐφορμή', 'ἐφόρμησις', 'συνεφεδρεύω', 'ἕωσπερ', 'ἀγώνιος', 'συνέστιος', 'συνευδοκέω', 'προσεπιτάσσω', 'συνοικία', 'ἐπιλείβω', 'ἡδύποτος', 'ἀθεμίστιος', 'συνίστωρ', 'εὐπρόσωπος', 'ζωγρίας', 'αἱματόω', 'προσθετέος', 'συνωθέω', 'καταχώννυμι', 'ἀκτέος', 'προσπαρακαλέω', 'ἄκληρος', 'ἠριγενής', 'προσοικέω', 'ἠοῖος', 'ἡρῷον', 'καρτερόω', 'τῆνος', 'εὔορμος', 'ἀλαοσκοπιά', 'τηλόσε', 'τήβεννα', 'ἡσύχιος', 'ἄληπτος', 'θέαινα', 'προστρέπω', 'Σχερία', 'ἄλοξ', 'Θηβαιεύς', 'προτέμνω', 'προσωφελέω', 'ταλαίφρων', 'προτρέχω', 'σωρός', 'κατάρρυτος', 'ἀμετάθετος', 'ἁμαρτωλός', 'ἀμέτρητος', 'ἁλώσιμος', 'κεφαλαιόω', 'ταναήκης', 'θρεπτήριος', 'ἀμπέλινος', 'ἀμοιβηδίς', 'ἀναγκαστέος', 'Ταρτησσός', 'θυηπολία', 'τάρφος', 'ἀνακινδυνεύω', 'λαφυροπωλέω', 'λατρεία', 'ἀναθορυβέω', 'πρυμνόν', 'ταώς', 'θυόεις', 'Μεγαρικός', 'μεγαλωστί', 'θωΰσσω', 'ἀγέραστος', 'Ἠχώ', 'ἁμαρτῆ', 'ἀνασχίζω', 'ἄγονος', 'ἱερομηνία', 'ἱερόσυλος', 'κερδοσύνη', 'ἱερωσύνη', 'ἀέριος', 'σαγηνεύω', 'Ἀδράστεια', 'οἰστράω', 'ἀνορύσσω', 'αἱρετής', 'ἰήϊος', 'ἀλεκτρύαινα', 'Πυθιάς', 'ἀντίδουπος', 'ἱππαρχέω', 'ἀκρόαμα', 'ἀντιθέω', 'ἀκμής', 'ἀντεξάγω', 'ἱπποτροφία', 'ἄμορφος', 'ἱπποκόμος', 'ῥαθάμιγξ', 'ἀπαίδευτος', 'ἀνταμύνομαι', 'ἰχώρ', 'ἴστωρ', 'σαλπίζω', 'κακόνοος', 'ἀπέλεθρος', 'Καῖσαρ', 'ἀποδοκεῖ', 'καινότης', 'καλινδέομαι', 'τέλσον', 'κληρουχία', 'Καλλιόπη', 'ἀποκινδυνεύω', 'αὐλῶπις', 'ἀποδιώκω', 'ἀποδειροτομέω', 'κατασχεθεῖν', 'βιωτικός', 'ἀπόπειρα', 'καλλιστέφανος', 'καλλιρέεθρος', 'ῥωπήϊον', 'γυμνασία', 'σάλος', 'ἀρείφατος', 'ἀποσπένδω', 'ἀπόρνυμαι', 'σηπεδών', 'τερασκόπος', 'σέλμα', 'κατερητύω', 'κατολιγωρέω', 'κεμάς', 'κέδρος', 'κατῶρυξ', 'ἄροσις', 'κέντημα', 'ἄρνειος', 'σκαλμός', 'ἀρτίπους', 'ἀρτεμής', 'σισύρα', 'σιτοποιός', 'αὐτεπάγγελτος', 'ἄρωμα', 'σκληρότης', 'ἀσπουδί', 'ἐπάρατος', 'ἐπενήνοθε', 'κισσύβιον', 'εὐημερία', 'αὐλητικός', 'εὐδιάω', 'ἀτταγᾶς', 'ἠρινός', 'σμινύη', 'ἀφελής', 'σμυγερός', 'Στάγιρος', 'ἰσότης', 'ἱπποβότης', 'κοπιάω', 'σταγών', 'κότινος', 'ἀδάματος', 'σπιθαμιαῖος', 'καταστένω', 'κορυστής', 'βηλός', 'βέβηλος', 'λισσάς', 'βλωθρός', 'βουλυτός', 'βούλημα', 'σταλαγμός', 'γανάω', 'μέλε', 'κώκυμα', 'οἰδέω', 'γλυφίς', 'ὄγμος', 'ξουθός', 'γημόρος', 'γηθοσύνη', 'Λυρνησσός', 'ὁμομήτριος', 'ὁμόω', 'μόσσυν', 'ὀλοφυρμός', 'κυπαρίσσινος', 'οἰχνέω', 'σπολάς', 'σπήλαιον', 'δαίτης', 'στωμυλία', 'οἰνοβαρής', 'οἰκουρέω', 'γρόσφος', 'ἀεικία', 'δαφοινός', 'οὖθαρ', 'ἀποτηλοῦ', 'ὀρχηστής', 'λειτουργός', 'ἀφοσιόω', 'πατροκασίγνητος', 'παρατρίβω', 'παρωθέω', 'Λαρισαῖος', 'στείβω', 'παραποτάμιος', 'παραπομπή', 'διάδηλος', 'διαπτοέω', 'δηλαδή', 'ἀντιφερίζω', 'πινάκιον', 'πολυκηδής', 'πλάνης', 'διάπλοος', 'πολίχνη', 'διάπειρα', 'διανομή', 'λῆρος', 'λισσός', 'Ποτνιάς', 'πολυειδής', 'πόσε', 'διεξαγωγή', 'πολύχαλκος', 'στρεύγω', 'πλινθεύω', 'πολυπήμων', 'αὐχμέω', 'λοφιά', 'λύγξ2', 'λογοποιός', 'προεδρία', 'αὐσταλέος', 'αὐγάζω', 'διαχωρίζω', 'διείρομαι', 'δίδημι', 'προδιαφθείρω', 'ἔγκοτος', 'συμπάσχω', 'προσαιρέομαι', 'διερευνάω', 'τετράπηχυς', 'λυσιμελής', 'προξενία', 'διεκπεράω', 'διαζεύγνυμι', 'διαδατέομαι', 'πρόχνυ', 'πρυλέες', 'Πύθης', 'λωβητήρ', 'διϊκνέομαι', 'διηθέω', 'προσεάω', 'διολισθάνω', 'προσπολεμόομαι', 'προσπληρόω', 'σεμνόω', 'σιδήριον', 'Σικανία', 'πτίλος', 'στέαρ', 'δορπέω', 'δορκάς', 'σμύχω', 'σπόρος', 'δολοφονέω', 'μάσσων', 'δρύπτω', 'στροφάλιγξ', 'σμῖλαξ', 'δράμημα', 'στίλβω', 'συναπόλλυμι', 'μεγαλύνω', 'μεγαλαυχέω', 'δυσθυμία', 'στρατηλάτης', 'ὕπαρξις', 'μελάνυδρος', 'ὑποδαμνάω', 'ὑπογραφή', 'Μελία', 'μελίγηρυς', 'μεσόδμη', 'εὐερκής', 'φελλός', 'σφάγιος', 'φειδώ', 'ἐφήδομαι', 'ἐπιμίξ', 'εἰσχέω', 'φλοιός', 'τανυσίπτερος', 'εἰλαπινάζω', 'τειχήρης', 'μεταδιώκω', 'τεχνάζω', 'ἐπισμυγερός', 'μετανίσομαι', 'ἀγηνορία', 'ἑκατόμπεδος', 'ἐκδημέω', 'ἐρύθημα', 'ἱππιοχάρμης', 'χολή', 'ὑλοτόμος', 'ἐκλαμβάνω', 'Ποσιδήϊον', 'μεταρρίπτω', 'μεταπείθω', 'φυσίζοος', 'ἐκκρούω', 'μετήορος', 'Αἴσωπος', 'Γυγαίη', 'μήκων', 'μονόξυλος', 'Φυλεύς', 'Μέροψ', 'μητιόεις', 'Καύκωνες', 'Κλεοφῶν', 'μισθοδοσία', 'Οὐαλέριος', 'Παρύσατις', 'Καλλιρρόη', 'στρατόω', 'Σόλοι', 'Κίος', 'ποτόν', 'Φεραῖος', 'μόριος', 'ναυτίλος', 'ῥῶ', 'νεκτάρεος', 'μήτις', 'ἐννέωρος', 'σχοινίον', 'νεάτη', 'ναυσιπέρατος', 'ἐπαλάομαι', 'νεοσσιά', 'περίλοιπος', 'οἰκτίζω', 'συζεύγνυμι', 'συγκομιδή', 'συγκάθημαι', 'συλλαβή', 'νήνεμος', 'ἀντιδράω', 'νικηφορία', 'συμπολιορκέω', 'ἐξαυδάω', 'ἀγλαόκαρπος', 'ἐξόπιθεν', 'ἀποστυγέω', 'ἀθλέω', 'ἐξοικοδομέω', 'ἁδρός', 'ἄτεκνος', 'συναγορεύω', 'ἀθῷος', 'ἀρτάβη', 'ἀρτέομαι', 'σύμπλοος', 'ἄρμενα', 'ἀρότης', 'Ἄραψ', 'ἀεσίφρων', 'ἀφορία', 'ἄφενος', 'αὐχμός', 'σιτοδεία', 'αὐτοφυής', 'νωθής', 'ἐπανατέλλω', 'ἐπεκτείνω', 'ἐπεισπίπτω', 'ὁδοποιέω', 'ἀκμηνός', 'ἄκμηνος', 'ξηραίνω', 'ἐπαράομαι', 'ἀλγύνω', 'ἀκρωτηριάζω', 'ἐπίγραμμα', 'συναδικέω', 'οἰήιον', 'ἐπιμειδάω', 'εἰσπέτομαι', 'ἐκπορθέω', 'ἐκραίνω', 'ἐπιίστωρ', 'ἐκπαθής', 'ἐπιδορατίς', 'ἐπικλάω', 'οἰνάνθη', 'ὀκέλλω', 'ἐμβριθής', 'ἅμμα', 'ἀμπελόεις', 'ἀμολγός', 'ἀναγνεία', 'ὀκνηρός', 'ἀναλέγω', 'ἀνάλογος', 'ὀλίγωρος', 'ἑφθός', 'ἔφορμος', 'ἀναπείρω', 'εὐῶπις', 'εὐχαριστία', 'ἀναπλόω', 'ἀντέπειμι', 'ὀξύτης', 'ἐφήμερος', 'ἀνηκουστέω', 'συνάλλαγμα', 'ἄνεσις', 'ἀνείργω', 'θυμικός', 'ὀλοφώϊος', 'ὀλοφώιος', 'ἀναψύχω', 'σύμφυτος', 'θέρμη', 'ἐπίταξις', 'ἐπίσωτρον', 'συναναβαίνω', 'συναναγκάζω', 'κάμμορος', 'ἐπιφορέω', 'ἀντέξειμι', 'ἐρέθω', 'κορέω', 'ἀντιφωνέω', 'κόρυμβος', 'καταπρηνής', 'συνεξέρχομαι', 'καταπέτομαι', 'ἀπάρχομαι', 'ἐρεύθω', 'ἄπλοια', 'ἀποσκοπέω', 'λογοποιέω', 'λίψ', 'συνεξορμάω', 'ὁπλή', 'κατερέω', 'ἀποδέω', 'ἀποδεκτέος', 'κατασκήπτω', 'μάσσω', 'ὅριον', 'ἀποκλαίω', 'ἀποκληρόω', 'ἀπόκλητος', 'ἀπόκειμαι', 'ἀπολαγχάνω', 'τρίμηνος', 'εὐήρης', 'εὐθηνέω', 'εὐεργέτημα', 'κρουνός', 'ἄπολις', 'κυρτός', 'ἀπόλεμος', 'λίβανος', 'εὔθυμος', 'εὐθεώρητος', 'ὀλισθάνω', 'μαχαιροφόρος', 'μανικός', 'ἄρθμιος', 'εὐτείχεος', 'εὔχαρις', 'ἑψιάομαι', 'οὐδαμά', 'παραπορεύομαι', 'ἐφαρμόζω', 'ἀρχαιρέσια', 'τριακόντορος', 'Ἅρπυιαι', 'τραγῳδέω', 'ὀχετός', 'περιδέω', 'τριπλάσιος', 'πένταθλον', 'ἄσκοπος', 'ἀστραπή', 'ᾆσμα', 'Βάκχευμα', 'παστάς', 'ἀτερπής', 'ὀχλίζω', 'ἀτέκμαρτος', 'Ῥαδάμανθυς', 'ἄτροπος', 'ζαμενής', 'ῥᾳδιουργία', 'σταφυλή', 'ἡδυμελής', 'πρίω', 'σταθμόομαι', 'ἡλικιώτης', 'κάρ', 'πότερον', 'σκιερός', 'παιγνία', 'προτύπτω', 'τηλαυγής', 'ἡσυχῇ', 'ἦρα', 'ἦνις', 'ἀφυλακτέω2', 'σαφηνής', 'βαθύκολπος', 'Ἀντισθένης', 'βέλτερος', 'στρατιῶτις', 'βυσσός', 'συμπροπέμπω', 'θυμοβόρος', 'θυίω', 'γενετή', 'θωρακίτης', 'Τιμολέων', 'συνεκπίπτω', 'ἰατήρ', 'τάφος2', 'ὑετός', 'ποδηνεκής', 'γλίχομαι', 'ὑψόω', 'ἰδίω', 'Γηρυόνης', 'παρείκω', 'ἀγρυπνία', 'σαυρωτήρ', 'ἄγκοινα', 'δασμοφόρος', 'ἀγακλεής', 'ἄλευρον', 'πάντοτε', 'δεινόω', 'ἀλκί', 'ἀλκυών', 'ἀναφύω', 'ἀνατλῆναι', 'ἀνάμιγα', 'ἀναμφισβήτητος', 'χρυσηλάκατος', 'παραγωγή', 'ἱππόδρομος', 'Μεγάρη', 'Αὐγείας', 'Πίνδος', 'καλαῦροψ', 'διαζώννυμι', 'καθιερόω', 'καλλιγύναιξ', 'κάλλιμος', 'Μετάνειρα', 'καλάσιρις', 'διαλαγχάνω', 'διακαίω', 'μέσαυλος', 'λῆμμα', 'κῶμα', 'ἐκκαθαίρω', 'Τριτογένεια', 'ἑκκαιδέκατος', 'τρίγωνος', 'νεῦρον', 'ἁλιεύς', 'λῃστεύω', 'τριπλόος', 'λαοσσόος', 'ἀλίμενος', 'ἐκρέω', 'ἀλλοτριόω', 'κρυφαῖος', 'πεῖσα', 'ἀμέλει', 'ἀμαυρός', 'πρωτοστάτης', 'νεκρόω', 'προσφύω', 'πελανός', 'ἀμφασίη', 'προσχράομαι', 'ἀνακοινόω', 'ἀντλέω', 'ἀναπτερόω', 'κορυφαῖος', 'κρατερῶνυξ', 'ὀρφναῖος', 'ἀναστέλλω', 'κρόκος', 'ἐνθρῴσκω', 'πεντακισμύριοι', 'κρυόεις', 'κραυγάζω', 'ἐνσκίμπτω', 'ἐνοχλέω', 'ἄνοδος', 'ἐνωμοτία', 'ἄνοδος2', 'ἀνθηρός', 'ἐπήτριμος', 'τετραίνω', 'Περσηΐς', 'ἐξάνειμι', 'κυβερνητικός', 'ἐπαναγκάζω', 'σύνοπτος', 'ἐξαρνέομαι', 'κρύσταλλος', 'κυνηγετέω', 'κυκεών', 'ἀπαίνυμαι', 'ἐξυβρίζω', 'κυνηγέτης', 'κυνώπης', 'τανύπεπλος', 'πτελέα', 'κώλυμα', 'ἐπάϊστος', 'ἀβουλέω', 'πυκνόω', 'κωμήτης', 'πτύσσω', 'πρωκτός', 'ἐπαρχία', 'ῥοῖζος', 'ἀμάω2', 'ῥῦμα', 'ἐπιδιαβαίνω', 'ἐπευφημέω', 'ἀποκατάστασις', 'ἀποστροφή', 'τέλμα', 'ἐπίκαιρος', 'ἀποσταυρόω', 'ἀποκάμνω', 'περιπορεύομαι', 'ἐπικλείω', 'συμπληρόω', 'ἀποσῴζω', 'αἰθέριος', 'ὑπέροχος', 'περιστερά', 'ἐπιλάμπω', 'περίρρυτος', 'ἀπαρνέομαι', 'περισπασμός', 'πετρήεις', 'ἀναλογίζομαι', 'ὑπερηφανία', 'περιφορά', 'περιμάχητος', 'ἀλλαγή', 'ὑπεξέρχομαι', 'βαρύτης', 'Ἁλικαρνασσεύς', 'ἐπικαταβαίνω', 'περικάθημαι', 'γοργός', 'γόης', 'γνάμπτω', 'ἐπισημασία', 'ἐπιρρώομαι', 'φιλοδοξέω', 'Φάρος', 'διεξάγω', 'ἀσθμαίνω', 'πόλινδε', 'ἐπιτίμησις', 'χεῖμα', 'ὑπερῴα', 'περιτρέχω', 'ὕπνον', 'ἐμπλήσσω', 'λίπτομαι', 'περιφερής', 'ἀψόρροος', 'ἐπίμαχος', 'Ἀχαιικός', 'ἀφομοιόω', 'ἐπιχράω', 'λυπρός', 'ὑψιπέτης', 'πινυτός', 'ὑπόπτερος', 'βαλλάντιον', 'καταλήγω', 'ἔνεροι', 'καταξιόω', 'μεταίτιος', 'Μέλας', 'μεγαλόφρων', 'ὑφηγέομαι', 'εὔπεπλος', 'Ἴφιτος', 'ματεύω', 'κατασκοπή', 'κάπριος', 'ἀραῖος', 'Λυκομήδης', 'θηρευτής', 'φαέθω', 'Βορυσθενίτης', 'βρώμη', 'θεωρός', 'μῶμος', 'θέρω', 'κηδεύω', 'μόσχος2', 'Ῥοδόπη', 'θέμεθλα', 'ὄργανος', 'Κῷος', 'Ὀλύμπια', 'θοίνη', 'Θρῖα', 'θλίβω', 'πάππης', 'ἵππιος', 'ἱζάνω', 'γενεαλογέω', 'ἱππόκομος', 'καλλίρροος', 'Στράτιος', 'περιβαίνω', 'Ἰώ', 'γήλοφος', 'ἴτυς', 'ἰσχυρίζομαι', 'Ἀμαζονίς', 'ἐγκώμιον', 'κατατρίβω', 'Ἀριστόνικος', 'Καλυδών', 'συνομολογέω', 'Φαρσάλιος', 'δαήμων', 'φανή', 'πυρπολέω', 'εὐλογία', 'εὐρυμέτωπος', 'νύχιος', 'ἐϋστρεφής', 'Δηώ', 'εὐσχημοσύνη', 'δημηγορία', 'Χρύσης', 'διαγγέλλω', 'εὐφυΐα', 'Νευροί']

# questa f recupera tutti gli elementi doppioni, mettendoli in una lista (ovviamente se un elemento è presente più volte lo elimina)
def retrieve_doubles():
    try:
        
        with open("dict_401_600.json", "r") as file:
            data = json.load(file)
            
            #faccio una copia della lista di doppioni, almeno opero su quella e non intacco quella originale
            copy_doubles_to_delete = doubles_to_delete.copy()
            
            
            elements_to_retrieve = []
            for element in data:
                if element["lemma"] in copy_doubles_to_delete:
                    elements_to_retrieve.append(element)
                    del copy_doubles_to_delete[copy_doubles_to_delete.index(element["lemma"])]
                    
            
                        
        print(f"elementi recuperati: {len(elements_to_retrieve)}")
            
       
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    
    return elements_to_retrieve



def delete_double():
    try:
        
        with open("dict_401_600.json", "r") as file:
            data = json.load(file)
            print(f"Lunghezza file iniziale: {len(data)}")
            
            for element in list(data):
                if element["lemma"] in doubles_to_delete:
                    del data[data.index(element)]
            
                    
            
                        
            print(f"elementi senza nessun doppione {len(data)}")
            
            
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    return data
    
   




combined_data = retrieve_doubles() + delete_double()

with open("dict_401_600_cl.json", "w") as file:
    json.dump(combined_data, file, ensure_ascii=False, indent=2)

