""" funzionamento

problema: ho un file json con dati abbastanza complessi che presentano dei doppioni, cioè ci sono gli stessi oggetti json due o più volte. 
La logicadi questo programma è semplice: 
data la lista degli elementi che si ripetono più di una volta, la prima funzione li estrae, ottendo una lista di tutti gli oggetti json doppioni. Ovviamente in questa lista
ogni oggetto json è ridotto a uno solo. 

La seconda funzione invece prende tutti gli elementi che sono doppioni e li elimina spudoratamente -> c'è un problema:  se ha una lista di parole da eliminare perché doppione, le elimina tutte, 
quando invece dovrebbe lasciarne uno. 

Ecco che, alla fine dello script, faccio semplicemente la somma delle parole che erano doppioni (ovviamenete i doppioni sono stati eliminati) + tutta la lista originale senza nessun doppione (quella senza nemmeno l'accoretezza di lasciarne uno

"""

import json 

doubles_to_delete = ['ἀμίμητος', 'ἀμεταμέλητος', 'βράγχος', 'ἐρυσάρματες', 'ἐρυκανάω', 'ἑρμηνεία', 'βᾶρος', 'ἁλίπλαγκτος', 'ἀνακαλύπτω', 'ἀναζωπυρέω', 'ἀνάδοσις', 'ἀναγωγία', 'γάστρα', 'βύω', 'ἐσθέω', 'δράγμα', 'ἑρμίς', 'ἀνασταχύω', 'ἀναρτέομαι', 'ἄναρκτος', 'ἄφετος', 'ἀναπολόγητος', 'ἀφαρπάζω', 'γαλέη', 'γρύζω', 'εὐαρίθμητος', 'εὔδιος', 'εὐαγγέλιον', 'βητάρμων', 'εὐηφενής', 'εὐκέλαδος', 'γλοιός', 'γλάγος', 'εὔδρομος', 'εὖγμα', 'γεῦσις', 'γῆθεν', 'ἀπαλθαίνομαι', 'εὐήλιος', 'γυναιμανής', 'γνωμοτύπος', 'ἀποικοδομέω', 'ἀποδύρομαι', 'εὖνις2', 'εὐκαταγώνιστος', 'ἐφοδιάζω', 'ἀποστυφελίζω', 'ἀποστρατοπεδεύομαι', 'ἀποσήπομαι', 'γλυκύθυμος', 'ἀπόπτυστος', 'ἀποπήγνυμι', 'εὐπραγέω', 'δεῖσα', 'δεῖξις', 'εὑρετικός', 'ἀργίπους', 'γυιός', 'ἀπόφραξις', 'δημόθεν', 'δεσποτέω', 'εὐπαλής', 'Ἠλύσιος', 'διαβυνέω', 'εὔπλαστος', 'διαγραφή', 'εὔπτερος', 'διαθέω', 'διαδικαιόω', 'διαδέω', 'διαδρομή', 'διαθεάομαι', 'δοτήρ', 'ἐκθέω', 'ἐφαιρέω', 'εὔχειρ', 'εὐρύτιμος', 'εὐρύστερνος', 'εὔσημος', 'ἐϋρραφής', 'εὑρησιλογέω', 'Δαρειογενής', 'εὐφρόσυνος', 'δάκρυμα', 'εὔτρητος', 'διαπίμπρημι', 'διαπαύω', 'διάτριχα', 'διατινάσσω', 'διερείδω', 'ἐφολκίς', 'διαστρατηγέω', 'Θετίδειον', 'διδασκαλικός', 'ἐφεψιάομαι', 'ἐλεγειοποιός', 'ἐλαφηβολία', 'ἑλιγμός', 'ἐλευθεριότης', 'ἑλετός', 'ἑλεσπίς', 'ἐλεόν', 'ἑλειοβάτης', 'ἐλεήμων', 'ἐλεγκτικός', 'ἐλλύχνιον', 'Ἐλλοπία', 'ἐλλιμένιος', 'ἐλλιμενικός', 'Ἑλλησποντίας', 'Ἑλλησποντιακός', 'ἐλλήγω', 'ἑλλέβορος', 'ἐλλαμπρύνομαι', 'ἑλκώδης', 'ἔμετος', 'ἐμβάφιον', 'ἐμβάπτω', 'ἐλυτρόω', 'ἔλυμος', 'ἔλυμα', 'ἐμπεδοσθενής', 'ἐμπάλλομαι', 'ἔμπαιος', 'ἐμπαθής', 'ἔμμορος', 'ἔμμονος', 'ἐμμελετάω', 'ἐναγκυλάω', 'ἐναγείρω', 'ἔμφοβος', 'ἐμπολέμιος', 'ἔμπλην', 'ἐμπλάζω', 'ἐμπικραίνομαι', 'ἐμπειρικός', 'ἐνδιατάσσω', 'ἐνδιασπείρω', 'ἑνδεκάκλινος', 'ἐναφίημι', 'ἔναυσμα', 'ἐνάρμοστος', 'ἐναρμόνιος', 'ἐναποτίνω', 'ἐναμοιβαδίς', 'ἐναμέλγω', 'ἔναιμος', 'ἐναγκυλίζω', 'ἐνευδιάω', 'ἐνευδαιμονέω', 'ἐνεπάγομαι', 'ἐνενηκοστός', 'ἐνελαύνω', 'ἐνείρω', 'ἐνείλλω', 'ἐνδυστυχέω', 'ἐνοίκησις', 'ἐννυκτερεύω', 'ἐννεακαιδέκατος', 'ἐννεακαίδεκα', 'ἐννάσσω', 'ἐνιππεύω', 'ἑνικός', 'ἐνιζάνω', 'ἐνθυμία', 'ἐνθεάζω', 'ἐνθακέω', 'ἐνῆμαι', 'ἐνήλικος', 'ἐνηβητήριον', 'ἐνευρίσκω', 'ἐντενής', 'ἐνταφιασμός', 'ἐνταφιάζω', 'ἐνσχερώ', 'ἐνστάτης', 'ἐνσπείρω', 'ἐνσημαίνω', 'ἐνόρκιος', 'ἐξαλλαγή', 'ἑξαετής', 'ἐξαγωνίζομαι', 'ἐξαγριόω', 'ἐξάγιστος', 'ἐντυπόω', 'ἐντρίβω', 'ἐντριβής', 'ἐντράπελος', 'ἑξάπεδος', 'ἐξανθέω', 'ἐξανέψιοι', 'ἐξανδραπόδισις', 'ἐξαναστρέφω', 'ἐξαναβρύω', 'ἐξαναβαίνω', 'ἐξαμελέω', 'ἐξαφαιρέω', 'ἐξαυχέω', 'ἐξαυτομολέω', 'ἐξάρχων', 'ἐξαρνητικός', 'ἐξαργυρίζω', 'ἐξάργματα', 'ἐξαποδύνω', 'ἑξαπλάσιος', 'ἐξαπεῖδον', 'ἐξερεύγομαι', 'ἐξέρεισις', 'ἐξεπίτηδες', 'ἐξελασία', 'ἐξείλλω', 'ἐξευκρινέω', 'ἔξεσις', 'ἐξερωτάω', 'ἐξερωέω', 'ἐξεριθεύομαι', 'ἐξοιχνέω', 'ἐξόγκωμα', 'ἑξκαιδέκατος', 'ἐξιστορέω', 'ἐξικετεύω', 'ἐξιδρύω', 'ἐξιδιασμός', 'ἐξέψω', 'ἐξεφίημι', 'ἐξυπειπεῖν', 'ἐξυπανίστημι', 'ἐξόφθαλμος', 'ἐξουσιαστικός', 'ἐξοσιόω', 'ἐξορκισμός', 'ἐξόριστος', 'ἐξορθόω', 'ἐξόμορξις', 'ἐξομολόγησις', 'ἐξόμνυμι', 'ἐξομαλίζω', 'ἐπαναβληδόν', 'ἐπαμαξεύω', 'ἐπάλλαξις', 'ἐπαλετρεύω', 'ἐπαίτης', 'ἐπαινετέος', 'ἐπαγλαΐζω', 'ἐπαγάλλομαι', 'ἐξωτέρω', 'ἐξώστρα', 'ἐξωκεανίζω', 'ἐξυφηγέομαι', 'ἐπαχλύω', 'ἐπαφάω', 'ἐπαυχένιος', 'ἐπαύξησις', 'ἐπαύλιον', 'ἐπάρκεσις', 'ἐπάντης', 'ἐπανιτέος', 'ἐπαναχώρησις', 'ἐπανάσεισις', 'ἐπαναπηδάω', 'ἐπανακυκλέω', 'ἐπανακρούω', 'ἐπαναδιπλάζω', 'ἐπεμβάτης', 'ἐπέκπλοος', 'ἐπεισφρέω', 'ἐπείσειμι', 'ἐπεισβάλλω', 'ἐπεισαγωγή', 'ἐπηρεάζω', 'ἐπηπύω', 'ἐπηλυγάζω', 'ἐπεξορκίζω', 'ἐπεξαγωγή', 'ἐπεντέλλω', 'ἐπεντείνω', 'ἐπεντανύω', 'ἐπενδύτης', 'ἐπενδύνω', 'ἐπεναρίζω', 'ἐπιδαψιλεύω', 'ἐπιγουνίδιος', 'ἐπιγναμπτός', 'ἐπίγαιος', 'ἐπιβώμιος', 'ἐπιβριθής', 'ἐπιβουλία', 'ἐπιβουλευτής', 'ἐπιβόητος', 'ἐπιβοήθεια', 'ἐπιβλής', 'ἐπιβλέπω', 'ἐπιβάσκω', 'ἐπιβάλλον', 'ἐπιέλδομαι', 'ἐπιδρομία', 'ἐπιδιατείνω', 'ἐπιδιαγιγνώσκω', 'ἐπιδημία', 'ἐπικαίω', 'ἐπιμύρομαι', 'ἐπιστάζω', 'ἀνόρνυμι', 'ἄση', 'ἀαγής', 'ἐπίθημα', 'ἐπινωμάω', 'συνναίω', 'συνναύτης', 'συνθραύω', 'θηριόω', 'ἐπικομπέω', 'ἐπιθειάζω', 'ἐπιδίφριος', 'ἐπιθεραπεύω', 'ἀντίληψις', 'ἐπιπάσσω', 'ἐπικουφίζω', 'ἐπικνάω', 'τηλεφανής', 'ἀέσκω', 'ἐπιμαχία', 'ἐπικρίνω', 'Δύσπαρις', 'συστρατοπεδεύομαι', 'ἐπιμαρτυρέω', 'ἄοπλος', 'διχοτομέω', 'ταναόδειρος', 'ἐπιξυνόω', 'σῶστρα', 'σῶκος', 'σχῖνος', 'σχηματισμός', 'ἀπανθρακίζω', 'ἐπινηνέω', 'ἐπίπλοον', 'ἐπιπροσθέω', 'ἐπισκιάζω', 'ἐπισπαστήρ', 'ἀκονάω', 'ἀκληρία', 'ἄκεσμα', 'ἐπισκεπτέος', 'ἐπισπείρω', 'ἐπιρρήδην', 'ἐπίσταθμος', 'ἐπισφραγίζω', 'ἑπτάκις', 'ἐπίφορος', 'ἐπιτροπαῖος', 'ἐπιτλῆναι', 'ἀγριωπός', 'ἀπεχθής', 'ἀπέρρω', 'Ἀγρεύς', 'ἐποπίζομαι', 'ἀπαρτάω', 'ἀγλαόθρονος', 'ἐπιφρονέω', 'ἀπολυμαντήρ', 'ἑπτάμηνος', 'ἐργάτις', 'ἔποχος', 'ἐρατίζω', 'ἄζηλος', 'ἐπωπάω', 'ἀπόρρησις', 'ἀπόρρυσις', 'ἄρκευθος', 'αἴγεος', 'ἀρδεύω', 'ἀργυρόπους', 'ἐριστικός', 'ἀσφάραγος', 'ἄστρωτος', 'ἄστοχος', 'ἀκαλαρρείτης', 'ἀσμενέω', 'ἀστακτί', 'ἀσίδηρος', 'ἀσελγής', 'ἀρθμέω', 'ἀκροπόλος', 'ζάκοτος', 'δικρατής', 'ἐχεπευκής', 'ἔφυδρος', 'διηέριος', 'ἔφορμος2', 'ἔφηβος', 'δυσέφικτος', 'δυσεξαπάτητος', 'ἔγκληρος', 'διόπτρα', 'Διονύσια', 'διχή', 'διτάλαντος', 'δυσπόνητος', 'διφυής', 'εἰσανάγω', 'δόλων', 'δύσζηλος', 'δορός', 'ἡλιοειδής', 'ἡβηδόν', 'ἡγητήρ', 'ἡβάσκω', 'ἡλιάς', 'ἐκθλίβω', 'δορίκτυπος', 'ἠλεκτρίς', 'δολιχόδειρος', 'δρασείω', 'ἰσχναίνω', 'δυσδίοδος', 'ἡμέριος', 'ἡμερινός', 'δωροδοκία', 'ἠρίον', 'θαλασσουργός', 'δυσπαθέω', 'ἡμίφωνος', 'ἔγκαρπος', 'θαυματοποιία', 'θεατέος', 'θάρσυνος', 'ἔγγραφος', 'εἰκάς', 'θεόσδοτος', 'ἐθάς', 'ἐπικαταδαρθάνω', 'θεόπεμπτος', 'θειασμός', 'εἴλη', 'εἰκοσάβοιος', 'εἴλυμα', 'τραπεζόω', 'εἰσαράσσω', 'θέσπισμα', 'εἰσκομιδή', 'θεσμοφόριον', 'θετός', 'ἐκδρομή', 'θερμότης', 'θνητογενής', 'θύωμα', 'θρανίτης', 'θέσσασθαι', 'εἰσοιχνέω', 'θρασυκάρδιος', 'θηρατός', 'θεωρίς', 'ἔκδοσις', 'ἔνοπλος', 'ἴσκω2', 'θρασυμέμνων', 'θρασυμήδης', 'θοάς', 'θιασεύω', 'θρησκεία', 'θρυαλλίς', 'θρόμβος', 'ἐκκρίνω', 'θριγκόω', 'ἱππευτής', 'θυτέος', 'ἑκυρός', 'ἐκτοπίζω', 'θυμομαχέω', 'θυμιατήριον', 'ἰθυντήρ', 'ἑλκυστάζω', 'ἐλλάμπω', 'κακοφραδής', 'κακούργημα', 'κακοποιός', 'ἰατρεῖον', 'ἰδιόομαι', 'καπίθη', 'ἱερουργία', 'καπηλεῖον', 'ἐλλεδανός', 'ἰδιωτεύω', 'ἱππομαχέω', 'εὔροος', 'καρχήσιον', 'εὔπλοια', 'ἱερομνημονέω', 'ἐναλείφω', 'Κατάδουποι', 'ἐμπτύω', 'εὐχάριστος', 'ἰοδνεφής', 'ἰόμωροι', 'ἑνδεκάπηχυς', 'ἰόπλοκος', 'ἐναρίμβροτος', 'ἐνδαίω2', 'καταμιαίνω', 'ἱππονώμας', 'ἱπποφόρβιον', 'ἱππόθεν', 'ἱππηλάσιος', 'ἐνεύδω', 'τερατώδης', 'ἐνιαχῆ', 'ἱπποπόλος', 'ἔνος', 'ἐνόδιος', 'ἐννεάπηχυς', 'ἐννεσίη', 'ἰσοδαίμων', 'ἰσόπλευρος', 'ἰσορροπέω', 'ἐντροπή', 'ἰσολογία', 'ἱστοβοεύς', 'ἱστοδόκη', 'Κάβειροι', 'ἐξανασπάω', 'ἐξαπάτη', 'ἑξάκις', 'ἑξήρης', 'καθυπερέχω', 'τέρετρον', 'καθόπλισις', 'ἐξευμαρίζω', 'ἐξοιμώζω', 'κακόμαντις', 'κακοήθης', 'ἐξονομαίνω', 'κακκάω', 'κακοδαιμονία', 'κατασχίζω', 'μεγαλεπίβολος', 'κατασώχω', 'ἐπανέρομαι', 'ἐπανατείνω', 'κάλλιον2', 'καλλιεπέομαι', 'ἐπέκτασις', 'μελῳδία', 'μελοποιός', 'κατεγγυάω', 'καταφράζω', 'μητραλοίας', 'Μηλόβοσις', 'κημός', 'καταῦθι', 'καταυλίζομαι', 'κατευνάζω', 'μοναχόω', 'μονάρχης', 'μοιχάω', 'κατευστοχέω', 'ναυλόω', 'καταδαπανάω', 'κατεναίρομαι', 'ἐπιπληρόω', 'κατερείκω', 'κατελεέω', 'κεκαφηώς', 'κατοκνέω', 'κατισχναίνω', 'ἐπίσκιος', 'ἐπίτεξ', 'νεόπλυτος', 'ἐπίρρυσις', 'νεοθηλής', 'ἐπιρρέπω', 'νεηγενής', 'κατηγόρημα', 'ὀκλάζω', 'καύσιμος', 'οἰνωπός', 'οἴνη', 'καυχάομαι', 'ἐποχή', 'κατουρόω', 'κατόνομαι', 'ὀξύβαφον', 'κεδρόω', 'Ὀτρυντεΐδης', 'κένανδρος', 'ὀστρακόω', 'καταμηνύω', 'κελαινώπας', 'παιδομαθής', 'παιδογονία', 'καταπάσσω', 'παιδεραστία', 'κεντρηνεκής', 'καταπακτός', 'κέντωρ', 'παγκρατιαστής', 'κεραμεύω', 'πανδοκέω', 'καταπέσσω', 'κέρμα', 'εὔσφυρος', 'εὐτρεφής', 'κιττώ', 'παρακαταβαίνω', 'παραίφασις', 'παραίρεσις', 'εὐρυθμία', 'εὐρυπυλής', 'παραγωγιάζω', 'εὐώψ', 'κατάρατος', 'εὔφωνος', 'καταπύγων', 'κιθαρῳδός', 'κηρύλος', 'κηπουρός', 'κατάσκιος', 'παροπλίζω', 'ἐχέτλη', 'Μάρων', 'κατασιτέομαι', 'ἐχθοδοπός', 'παρευτακτέω', 'παρέστιος', 'περικάκησις', 'περιζώννυμι', 'ἡδύπνοος', 'περιδέξιος', 'πεντηκοντήρ', 'ζωτικός', 'πενταπλάσιος', 'περισταυρόω', 'περιρραντήριον', 'περιπόρφυρος', 'περιπλανάομαι', 'ἡμερίς', 'περιμήκετος', 'κατημύω', 'περικομίζω', 'κλήθρα', 'Θησηΐς', 'πολεμαρχέω', 'κίσσα', 'κινδυνώδης', 'κινδυνευτέος']
# questa f recupera tutti gli elementi doppioni, mettendoli in una lista (ovviamente se un elemento è presente più volte lo elimina)
def retrieve_doubles():
    try:
        
        with open("dict_801_1000.json", "r") as file:
            data = json.load(file)
            
            #faccio una copia della lista di doppioni, almeno opero su quella e non intacco quella originale
            copy_doubles_to_delete = doubles_to_delete.copy()
            
            
            elements_to_retrieve = []
            for element in data:
                if element["lemma"] in copy_doubles_to_delete:
                    elements_to_retrieve.append(element)
                    del copy_doubles_to_delete[copy_doubles_to_delete.index(element["lemma"])]
                    
            
                        
        print(f"elementi recuperati: {len(elements_to_retrieve)}")
            
       
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    
    return elements_to_retrieve



def delete_double():
    try:
        
        with open("dict_801_1000.json", "r") as file:
            data = json.load(file)
            print(f"Lunghezza file iniziale: {len(data)}")
            
            for element in list(data):
                if element["lemma"] in doubles_to_delete:
                    del data[data.index(element)]
            
                    
            
                        
            print(f"elementi senza nessun doppione {len(data)}")
            
            
            
            
    except Exception as e:
        print(e)
    finally:
        pass
    return data
    
   




combined_data = retrieve_doubles() + delete_double()

with open("dict_801_1000_cl.json", "w") as file:
    json.dump(combined_data, file, ensure_ascii=False, indent=2)

